Revit 2026 API

# GenericGenericRefractionIndex Property

---

The property labeled "Refraction" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericRefractionIndex { get; }
```
```vb
Public Shared ReadOnly Property GenericRefractionIndex As String
	Get
```
```cpp
public:
static property String^ GenericRefractionIndex {
	String^ get ();
}
```
```fsharp
static member GenericRefractionIndex : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0.01, 5".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace